application/app/Repositories/ItemRepository.php

        //eager load
        $items->with(['category']);

        // Get the results and return them.
        return $items->paginate(config('system.settings_system_pagination_limits'));
---
select * from `categories` where `categories`.`category_id` in (8, 61)

    public function create() {

        //save new user
        $item = new $this->items;

        //data
        $item->item_categoryid = request('item_categoryid');
        $item->item_creatorid = auth()->id();
        $item->item_description = request('item_description');
        $item->item_unit = request('item_unit');
        $item->markup = request('item_markup');
        $item->margin = request('item_margin');
        $item->item_rate = request('item_rate');
        $item->type_id = request('item_typeid');
        $item->cost = request('item_cost');
        $item->price = request('item_price');

        $item->item_notes_estimatation = request('item_notes_estimatation');

        //save and return id
        if ($item->save()) {
---
insert into `items` (`item_categoryid`, `item_creatorid`, `item_description`, `item_unit`, `markup`, `margin`, `item_rate`, `type_id`, `cost`, `price`, `item_notes_estimatation`, `item_updated`, `item_created`) values ('61', 1, 'fg', 'hr', '233.33', '70.00', '15', '5', '150', '500.00', '', '2025-02-04 11:29:29', '2025-02-04 11:29:29')