application/app/Models/Type.php

select count(*) as aggregate from `items` where `items`.`type_id` = 3 and `items`.`type_id` is not null
---
    public function getCountItemsAttribute() {
        return $this->items()->count();