application/app/Http/Controllers/Items.php

    public function index(CategoryRepository $categoryrepo, Category $categorymodel,TypeRepository $typerepo) {

        //get items
        $items = $this->itemrepo->search();

        //get all categories (type: item) - for filter panel
        $categories = $categoryrepo->get('item');
        $typetypes = $typerepo->search();

        $gitems = $items->groupBy('category_id')->map(function($items, $key) use ($categorymodel) {
            return [
                'id' => $key,
                'name' => $categorymodel->findOrFail($key)->category_name,
---
select * from `categories` where `categories`.`category_id` = 8 limit 1