application/app/Http/Controllers/Projects.php

    public function show(TimerRepository $timerrepo, $id)
    {

        //get the project
        $projects = $this->projectrepo->search($id);

        //project
        $project = $projects->first();

        //set page
        $page = $this->pageSettings('project', $project);

        //refresh project
        $this->projectrepo->refreshProject($project);

        //apply permissions
        $this->applyPermissions($project);

        //get tags
        $tags_resource = $this->tagrepo->getByResource('project', $id);
        $tags_user = $this->tagrepo->getByType('project');
        $tags = $tags_resource->merge($tags_user);
        $tags = $tags->unique('tag_title');

        //clients contacts
        $contacts = \App\Models\User::where('clientid', $project['project_clientid'])->where('type', 'client')->get();
---
select * from `users` where `clientid` = 1 and `type` = 'client'

    public function budgets($id, ItemRepository $itemrepo) {
        $items = $itemrepo->search();
        Log::info('Items: ', $items->toArray());
        $project = $this->projectrepo->search($id)->first();
        $budgetItems = BudgetItem::where('item_id', $id)->with('budget')->get();
---
select * from `budget_items` where `item_id` = '1'

    public function prefillProject()
    {

        //get the template
        $template = \App\Models\Project::Where('project_id', request('id'))->first();
---
select * from `projects` where `project_id` = '1' limit 1